
  <!-- // $a = 15;
  // $b = 3;
  // $c = 10;
  // $answer1 = $a + $b;
  // $answer2 = $a - $b;
  // $answer3 = $a * $b;
  // $answer4 = $a / $b;
  // $answer5 = $a % $c;
  // print $answer1;
  // print "<br />";
  // print $answer2;
  // print "<br />";
  // print $answer3;
  // print "<br />";
  // print $answer4;
  // print "<br />";
  // print $answer5; -->




<!-- $a = 15;
$b = 3;
$c = 10;
$d = 5;

$a = $b;
$c += $d;

print $a;
print "<br />";
print $c; -->


<!-- 問1:比較演算子を用いて$aが$bよりも大きいということが正しいかどうかechoを用いて出力してください。(正 しいときは1が返ってきます。)
問2:比較演算子と論理演算子を用いて$aが10より大きいかつ30より小さいということが正しいかどうかechoを用 いて出力してください。(正しいときは1が返ってきます。)
問3:比較演算子と論理演算子を用いて$aまたは$bが5という値と一致するということが正しいかどうかechoを用 いて出力してください。(正しいときは1が返ってきます。) -->

<?php
$a = 20;
$b = 5;
// 問１
// echo($a > $b);



// 問2
// echo($a > 10 && $a < 30);


// 問3
// echo ($a || $b = 5); ×
// echo ($a == 5 || $b == 5);